{"active_at":"2012-02-12T00:00:00Z","address":"","cities_user_id":null,"city_id":0,"created_at":"2012-02-12T04:15:18Z","day_id":null,"descr":"\r\nI was in a weird place when he died. Just got a new job, was all over the place with my psychology and was learning a shitload of technology, due to being hired into a new workplace where most things were unfamiliar to me (example: non-relational datastores).\r\n\r\nSo one of the things we did was, go out and drink a lot to his memory. And another thing I personally did was, I freaked out a bit when he died, it was weird. I thought, how do we find out what is beyond iPad, now that he is gone? See, he pushed the envelope and invented things that perhaps would not be invented without him. He removed the keyboard from a computer (iPad), and he introduced smartphones which is really something.\r\n\r\nBut then (months later, actually), I felt okay again. Why? Because I feel that without him, there are other people equally and more talented, and there are enough problems to preoccupy beautiful minds. So for example previously I thought, oh I should spend some time on hardware design (and I can), because maybe Jobs popularized it. But then I thought about it some more and no, I should not get distracted by those things. I am perfectly capable of bringing to existence beautiful things myself, without Jobs. I never did like Apple and do not own Apple products.\r\n\r\nOn the reverse, I thought perhaps that with Jobs, a man cannot be so original because Jobs would be faster and better than some other man at bringing to existence beautiful objects. Now that Jobs is gone, that restriction no longer applies.\r\n\r\nSo overall, at least for me personally, I am as talented now as I was before Jobs died, and no I will not go in the same industry as he did, I will have my own ideas that were not achievable by him. Life goes on. Requiem for Jobs, and live goes on.","id":13771,"inappropriate_count":0,"is_anonymous":false,"is_done":0,"is_feature":1,"is_outsource":false,"is_public":1,"is_trash":0,"issue_id":null,"name":"Another Requiem: The Death of Steve Jobs","name_seo":"Another_Requiem_The_Death_of_Steve_Jobs-YHQCP","photo_content_type":"image/jpeg","photo_file_name":"jobs.jpg","photo_file_size":3657,"photo_updated_at":"2012-02-13T06:24:03Z","rating_denominator":0,"rating_numerator":0,"recommended":[{"active_at":"2012-02-03T00:00:00Z","address":"","cities_user_id":null,"city_id":0,"created_at":"2012-02-03T12:06:32Z","day_id":null,"descr":"In the raging 90's I had a job on the side, fixing electronics for friends and friends of friends. Me being an engineer and knowing the craft, the side gigs allowed me to get by the decade of recession relatively easily (Translator's note: the Russian economy and politics of the 90's were crazy, that's why they are dubbed \"raging 90's\").\r\n\r\nI mostly worked at this small village that was close to a big city, yet did not have any repairs / customer service for the electonics. This allowed me to pretty much own the market there. Although I had to walk 12km to get there, eventually I bought a bicycle and got to be quite efficient. I would take the train, then bike it 12km there. (Translator's note: commute in Russia is nowhere like commute in USA. A bicycle on the train is a rarity.)\r\n\r\nIn this village I got to know this one dude really well, sometimes I would even sleep over at his house if I finished work late. He had grown-up kids: the older sister was a police capitain, and two younger brothers, twins, where just about to graduate from the local polytech college. (Google map http://bit.ly/z1GBHR). Them being twins, I could not for the life of me tell the difference between them, but they weren't upset. Eventually they also provided me some work, mostly referring their friends, for me to fix their boomboxes. (Translator's note: a boombox would in those days be perhaps the most advanced electronic device owned by anyone in a remove village.) Once the twins finished college their sister hooked them up with the police. In the raging 90's it was hard to get a job anywhere, so they were fortunate for their sister's connections. One went into OMON unit, another went into the homicide unit. (Translator's note: OMON is the police unit chiefly concerned with managing then-common protests, demonstrations, and other urban events.)\r\n\r\nA mere year later I could easily distinguish the twins. The guy in the OMON grew some muscle and became this characteristic strongman. The guy in the homicide unit, on the other hand, became bleak, sad and sick-looking. Their father complained to me: the first son gets to be on the open streets all the time, has everyone's respect in the village, even bought a car (then-rarity in Soviet Russia). The second son, however, has to deal with corpses every day, gets no perks and no recognition at all.\r\n\r\nAnd hence, two twins who were at first indistinguishable to me, became quite different due to the nature of their work.","id":13762,"inappropriate_count":0,"is_anonymous":false,"is_done":1,"is_feature":1,"is_outsource":false,"is_public":1,"is_trash":0,"issue_id":null,"name":"Like two water drops are similar","name_seo":"Like_two_water_drops_are_similar-YONKL","photo_content_type":"image/jpeg","photo_file_name":"161740871.jpg","photo_file_size":48218,"photo_updated_at":"2012-02-03T18:13:52Z","rating_denominator":0,"rating_numerator":0,"subhead":"\r\nThis be done translated from Russian by I, Victor. Source: anekdot.ru The narrative is presented from 1st person point of view.\r\n\r\nA followup note regarding how employment changes appearance of people. (And not only employment.)","updated_at":"2012-02-03T18:13:53Z","user_id":1,"x":null,"y":null},{"active_at":"2012-02-03T18:12:07Z","address":"","cities_user_id":null,"city_id":20,"created_at":"2012-02-03T18:12:07Z","day_id":null,"descr":"I will tell you guys how I gave once a ride to a girl on my old Gixxer, back in Chi-town. So we meets on the internets and we goes to a dive bar in Logan square, and word for word I'm like hey, I got a motorcycle. She's like, seriously? Can you give me a ride? Sure! I say, finish my 3rd beer, and we go to the garage. I tell her how to get on, all the works. Then I find a small street and tell her, are you ready? Then, I twist the throttle a little bit.\r\n\r\n\"AAAAAAAAAAAHHHHHHHHHHH!!!!\" I hear from my pillion. My Gixxer, being a fast thing, well I kind of missed a stop signs and run a red light before being able to come to a \"controlled stop\" at the next stop sign. The police is already behind me, flashing their flashy lights. I ask my pillion if she knows how to get home from here, because I think I am going to jail.\r\n\r\nThe cops, they get out of their copmobile, come to me and say,\r\n\"You know we gotta bitch at you yeah?\"\r\nI say I know yeah.\r\n\"You know your passenger, she had her eyes closed and was screaming bloody mercy?\"\r\nI say no, didn't see her back there.\r\n\"You know why we stopped you?\"\r\nI say not.\r\n\"You run a yellow light. Next time be careful.\"\r\nPhhew! They didn't even notice. And I guess I didn't look too drunk, either.\r\n\r\nAnd that's how I give rides on my Gixxer.","id":13763,"inappropriate_count":0,"is_anonymous":false,"is_done":1,"is_feature":0,"is_outsource":false,"is_public":1,"is_trash":0,"issue_id":null,"name":"Ride my Gixxer","name_seo":"Ride_my_Gixxer-HIBFH","photo_content_type":"image/jpeg","photo_file_name":"1992_GSX-R750_whblue_450.jpg","photo_file_size":31033,"photo_updated_at":"2012-02-03T18:12:07Z","rating_denominator":0,"rating_numerator":0,"subhead":"The content below is imaginary. It didn't happen. Any semblance to actual persons or places is a coincidence.","updated_at":"2012-02-03T18:12:07Z","user_id":1,"x":null,"y":null},{"active_at":"2012-02-10T02:11:50Z","address":"","cities_user_id":null,"city_id":0,"created_at":"2012-02-10T02:11:50Z","day_id":null,"descr":"#include <sys/types.h>\r\n#include <sys/stat.h>\r\n#include <stdio.h>\r\n#include <stdlib.h>\r\n#include <fcntl.h>\r\n#include <errno.h>\r\n#include <unistd.h>\r\n#include <syslog.h>\r\n#include <string.h>\r\n\r\nint main(void) {\r\n        \r\n        /* Our process ID and Session ID */\r\n        pid_t pid, sid;\r\n        \r\n        /* Fork off the parent process */\r\n        pid = fork();\r\n        if (pid < 0) {\r\n                exit(EXIT_FAILURE);\r\n        }\r\n        /* If we got a good PID, then\r\n           we can exit the parent process. */\r\n        if (pid > 0) {\r\n                exit(EXIT_SUCCESS);\r\n        }\r\n\r\n        /* Change the file mode mask */\r\n        umask(0);\r\n                \r\n        /* Open any logs here */        \r\n                \r\n        /* Create a new SID for the child process */\r\n        sid = setsid();\r\n        if (sid < 0) {\r\n                /* Log the failure */\r\n                exit(EXIT_FAILURE);\r\n        }\r\n        \r\n\r\n        \r\n        /* Change the current working directory */\r\n        if ((chdir(\"/\")) < 0) {\r\n                /* Log the failure */\r\n                exit(EXIT_FAILURE);\r\n        }\r\n        \r\n        /* Close out the standard file descriptors */\r\n        close(STDIN_FILENO);\r\n        close(STDOUT_FILENO);\r\n        close(STDERR_FILENO);\r\n        \r\n        /* Daemon-specific initialization goes here */\r\n        \r\n        /* The Big Loop */\r\n        while (1) {\r\n           /* Do some task here ... */\r\n           \r\n           sleep(30); /* wait 30 seconds */\r\n        }\r\n   exit(EXIT_SUCCESS);\r\n}","id":13769,"inappropriate_count":0,"is_anonymous":false,"is_done":0,"is_feature":0,"is_outsource":false,"is_public":1,"is_trash":0,"issue_id":null,"name":"An example daemon","name_seo":"An_example_daemon-MSMGD","photo_content_type":"image/jpeg","photo_file_name":"daemon.jpg","photo_file_size":43653,"photo_updated_at":"2012-02-10T02:11:49Z","rating_denominator":0,"rating_numerator":0,"subhead":"A minimal daemon written in C.","updated_at":"2012-02-10T02:11:50Z","user_id":1,"x":null,"y":null},{"active_at":"2012-03-03T00:00:00Z","address":"","cities_user_id":null,"city_id":0,"created_at":"2012-03-03T05:40:52Z","day_id":null,"descr":"This happened a few years at the construction site where I happened to be working. The construction workers were preparing pre-construction primer, which is a coating that is used on steel plates prior to the fabrication of a part. It's prepared easily by combining tar and diesel fuel. This happening in Russia, the process of preparation of the substance was the shittiest imaginable: take a propane burner, boil diesel fuel, and throw bricks of tar in it.\r\n\r\nSo, when the \"kitchen\" caught on fire, I saw a visual confirmation of the salary disparity between the \"proletariat\" and the engineers: the \"proletariat\" was running away from the fire, while engineers where running towards it. I felt inspired.\r\n\r\nP.S.: there were no casualties.\r\n","id":13942,"inappropriate_count":0,"is_anonymous":false,"is_done":0,"is_feature":0,"is_outsource":false,"is_public":1,"is_trash":0,"issue_id":null,"name":"Who are engineers?","name_seo":"Who_are_engineers-KTWBI","photo_content_type":"image/jpeg","photo_file_name":"engineers.jpg","photo_file_size":50377,"photo_updated_at":"2012-03-03T05:40:51Z","rating_denominator":0,"rating_numerator":0,"subhead":"Translated from Russian by me.","updated_at":"2012-03-03T05:52:26Z","user_id":1,"x":null,"y":null}],"subhead":"","updated_at":"2012-02-13T06:24:05Z","user_id":1,"videos":[],"x":null,"y":null}